chore(export): clean up outdated docs and files
